## Setup

In [1]:
%load_ext sql

In [2]:
# Connect to sakila MySQL database
%sql mysql+mysqlconnector://iliarudiak:password@iliarudiak-macbook.local:3306/sakila

In [3]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## 01 Tables in Sakila Database

The Sakila database is a popular sample relational database schema, originally created by MySQL, that models a DVD rental store. 

There are 16 `BASE TABLES` and also views and other objects. They can be divided into several groups:
1) Films and actors (7 tables)

    a) Film metadata: `film`, `film_category`, `category`, `language`, `film_text`

    b) Actor information: `actor`, `film_actor`
2) DVD rental business (6 tables)

    a) Business operations: `store`, `staff`,`inventory`, `rental`, `payment` 

    b) Customers: `customer`
3) Miscellaneous (3 tables)
    a) `address`, `city`, `country`

### 01 All Tables and Views in the Sakila Database

In [22]:
%%sql
SHOW TABLES;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
23 rows affected.

[('actor',),
 ('actor_info',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('customer_list',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_list',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('nicer_but_slower_film_list',),
 ('payment',),
 ('rental',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff',),
 ('staff_list',),
 ('store',)]

### 02 Table or View?

We have 16 `BASE TABLES` and 7 `VIEWS` in the Sakila database.

In [27]:
%%sql
SELECT count(*) AS number_of_tables 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_SCHEMA = 'sakila';

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[(23,)]

We have 16 `BASE TABLE` objects in the Sakila database.

In [24]:
%%sql
SELECT count(*) AS number_of_tables 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_SCHEMA = 'sakila' 
  AND TABLE_TYPE = 'BASE TABLE';

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[(16,)]

In [23]:
%%sql
SELECT TABLE_NAME 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_SCHEMA = 'sakila' 
  AND TABLE_TYPE = 'BASE TABLE';

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
16 rows affected.

[('actor',),
 ('address',),
 ('category',),
 ('city',),
 ('country',),
 ('customer',),
 ('film',),
 ('film_actor',),
 ('film_category',),
 ('film_text',),
 ('inventory',),
 ('language',),
 ('payment',),
 ('rental',),
 ('staff',),
 ('store',)]

We have 7 `VIEW` objects in the Sakila database.

In [25]:
%%sql
SELECT count(*) AS number_of_views
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_SCHEMA = 'sakila' 
  AND TABLE_TYPE = 'VIEW';

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[(7,)]

In [26]:
%%sql
SELECT TABLE_NAME 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_SCHEMA = 'sakila' 
  AND TABLE_TYPE = 'VIEW';

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
7 rows affected.

[('actor_info',),
 ('customer_list',),
 ('film_list',),
 ('nicer_but_slower_film_list',),
 ('sales_by_film_category',),
 ('sales_by_store',),
 ('staff_list',)]

To see a type of a table we may use the following query:

In [13]:
%%sql
SELECT TABLE_TYPE 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_SCHEMA = 'sakila' 
  AND TABLE_NAME = 'staff';

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[('BASE TABLE',)]

In [12]:
%%sql
SELECT TABLE_TYPE 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_SCHEMA = 'sakila' 
  AND TABLE_NAME = 'staff_list';

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[('VIEW',)]

In [14]:
%%sql
SELECT TABLE_TYPE 
FROM INFORMATION_SCHEMA.TABLES 
WHERE TABLE_SCHEMA = 'sakila' 
  AND TABLE_NAME = 'film_text';

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
1 rows affected.

[('BASE TABLE',)]

## 02 Contents of tables in Sakila Database

### 01 Film metadata

In [5]:
%%sql
DESCRIBE film;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
13 rows affected.

[('film_id', 'smallint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('title', 'varchar(128)', 'NO', 'MUL', None, ''),
 ('description', 'text', 'YES', '', None, ''),
 ('release_year', 'year', 'YES', '', None, ''),
 ('language_id', 'tinyint unsigned', 'NO', 'MUL', None, ''),
 ('original_language_id', 'tinyint unsigned', 'YES', 'MUL', None, ''),
 ('rental_duration', 'tinyint unsigned', 'NO', '', '3', ''),
 ('rental_rate', 'decimal(4,2)', 'NO', '', '4.99', ''),
 ('length', 'smallint unsigned', 'YES', '', None, ''),
 ('replacement_cost', 'decimal(5,2)', 'NO', '', '19.99', ''),
 ('rating', "enum('G','PG','PG-13','R','NC-17')", 'YES', '', 'G', ''),
 ('special_features', "set('Trailers','Commentaries','Deleted Scenes','Behind the Scenes')", 'YES', '', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [6]:
%%sql
DESCRIBE film_category;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
3 rows affected.

[('film_id', 'smallint unsigned', 'NO', 'PRI', None, ''),
 ('category_id', 'tinyint unsigned', 'NO', 'PRI', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [7]:
%%sql
DESCRIBE category;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
3 rows affected.

[('category_id', 'tinyint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('name', 'varchar(25)', 'NO', '', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [8]:
%%sql
DESCRIBE language;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
3 rows affected.

[('language_id', 'tinyint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('name', 'char(20)', 'NO', '', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [9]:
%%sql
DESCRIBE film_text;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
3 rows affected.

[('film_id', 'smallint unsigned', 'NO', 'PRI', None, ''),
 ('title', 'varchar(255)', 'NO', 'MUL', None, ''),
 ('description', 'text', 'YES', '', None, '')]

### 02 Actor information

In [10]:
%%sql
DESCRIBE actor;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
4 rows affected.

[('actor_id', 'smallint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('first_name', 'varchar(45)', 'NO', '', None, ''),
 ('last_name', 'varchar(45)', 'NO', 'MUL', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [11]:
%%sql
DESCRIBE film_actor;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
3 rows affected.

[('actor_id', 'smallint unsigned', 'NO', 'PRI', None, ''),
 ('film_id', 'smallint unsigned', 'NO', 'PRI', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

### 03 Business operations

In [12]:
%%sql
DESCRIBE store;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
4 rows affected.

[('store_id', 'tinyint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('manager_staff_id', 'tinyint unsigned', 'NO', 'UNI', None, ''),
 ('address_id', 'smallint unsigned', 'NO', 'MUL', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [13]:
%%sql
DESCRIBE staff;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
11 rows affected.

[('staff_id', 'tinyint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('first_name', 'varchar(45)', 'NO', '', None, ''),
 ('last_name', 'varchar(45)', 'NO', '', None, ''),
 ('address_id', 'smallint unsigned', 'NO', 'MUL', None, ''),
 ('picture', 'blob', 'YES', '', None, ''),
 ('email', 'varchar(50)', 'YES', '', None, ''),
 ('store_id', 'tinyint unsigned', 'NO', 'MUL', None, ''),
 ('active', 'tinyint(1)', 'NO', '', '1', ''),
 ('username', 'varchar(16)', 'NO', '', None, ''),
 ('password', 'varchar(40)', 'YES', '', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [14]:
%%sql
DESCRIBE inventory;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
4 rows affected.

[('inventory_id', 'mediumint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('film_id', 'smallint unsigned', 'NO', 'MUL', None, ''),
 ('store_id', 'tinyint unsigned', 'NO', 'MUL', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [15]:
%%sql
DESCRIBE rental;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
7 rows affected.

[('rental_id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('rental_date', 'datetime', 'NO', 'MUL', None, ''),
 ('inventory_id', 'mediumint unsigned', 'NO', 'MUL', None, ''),
 ('customer_id', 'smallint unsigned', 'NO', 'MUL', None, ''),
 ('return_date', 'datetime', 'YES', '', None, ''),
 ('staff_id', 'tinyint unsigned', 'NO', 'MUL', None, ''),
 ('last_update', 'timestamp', 'NO', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [16]:
%%sql
DESCRIBE payment;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
7 rows affected.

[('payment_id', 'smallint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('customer_id', 'smallint unsigned', 'NO', 'MUL', None, ''),
 ('staff_id', 'tinyint unsigned', 'NO', 'MUL', None, ''),
 ('rental_id', 'int', 'YES', 'MUL', None, ''),
 ('amount', 'decimal(5,2)', 'NO', '', None, ''),
 ('payment_date', 'datetime', 'NO', '', None, ''),
 ('last_update', 'timestamp', 'YES', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]

In [17]:
%%sql
DESCRIBE customer;

 * mysql+mysqlconnector://iliarudiak:***@iliarudiak-macbook.local:3306/sakila
9 rows affected.

[('customer_id', 'smallint unsigned', 'NO', 'PRI', None, 'auto_increment'),
 ('store_id', 'tinyint unsigned', 'NO', 'MUL', None, ''),
 ('first_name', 'varchar(45)', 'NO', '', None, ''),
 ('last_name', 'varchar(45)', 'NO', 'MUL', None, ''),
 ('email', 'varchar(50)', 'YES', '', None, ''),
 ('address_id', 'smallint unsigned', 'NO', 'MUL', None, ''),
 ('active', 'tinyint(1)', 'NO', '', '1', ''),
 ('create_date', 'datetime', 'NO', '', None, ''),
 ('last_update', 'timestamp', 'YES', '', 'CURRENT_TIMESTAMP', 'DEFAULT_GENERATED on update CURRENT_TIMESTAMP')]